---
kind: type
id: T:Autodesk.Revit.DB.FilteredElementIterator
source: html/bb879a42-15eb-1704-7abc-0f4509ca89d2.htm
---
# Autodesk.Revit.DB.FilteredElementIterator

An iterator to a set of elements filtered by the settings of a FilteredElementCollector.

## Syntax (C#)
```csharp
public class FilteredElementIterator : IEnumerator<Element>
```